In [1]:
import pandas as pd 
ufo_data = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv')
ufo_data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo_data_copy = ufo_data.copy()



ufo_data_copy['Time'] = pd.to_datetime(ufo_data_copy['Time'])
ufo_data_copy['Time']

0       1930-06-01 22:00:00
1       1930-06-30 20:00:00
2       1931-02-15 14:00:00
3       1931-06-01 13:00:00
4       1933-04-18 19:00:00
                ...
18236   2000-12-31 23:00:00
18237   2000-12-31 23:00:00
18238   2000-12-31 23:45:00
18239   2000-12-31 23:45:00
18240   2000-12-31 23:59:00
Name: Time, Length: 18241, dtype: datetime64[ns]

In [8]:
ufo_data_copy['Time'].dt.year.mode()

0    1999
Name: Time, dtype: int32

In [34]:

ufo_data_copy['Date'] = ufo_data_copy['Time'].dt.date


result = ufo_data_copy[ufo_data_copy['State'] == 'NV']['Date']
result = result.diff()
result = result.dt.days.mean()
result

np.float64(68.92932862190813)

In [93]:
import pandas as pd 
test_series_1 = pd.Series([
    'Опыт работы 8 лет 3 месяца',
    'Опыт работы 3 года 5 месяцев',
    'Опыт работы 1 год 9 месяцев',
    'Опыт работы 3 месяца',
    'Опыт работы 6 лет'
])
test_series_2 = pd.Series([
    'Опыт работы 5 лет',
    'Опыт работы 5 месяцев',
    'Опыт работы 1 год 1 месяц',
    'Опыт работы 3 месяца',
    'Опыт работы 7 лет'
])
def get_experience(arg):
    year = arg.split()[3][:3]
    if len(arg.split()) > 4:
        month = int(arg.split()[4])
    else:
        month = 0
    if year == 'лет' or year == 'год':
        years_to_month = int(arg.split()[2])*12
        return int(years_to_month+month)
    else:
        return int(arg.split()[2])
     

test_series_2

0            Опыт работы 5 лет
1        Опыт работы 5 месяцев
2    Опыт работы 1 год 1 месяц
3         Опыт работы 3 месяца
4            Опыт работы 7 лет
dtype: object

In [94]:
result = test_series_2.apply(get_experience)
result

0    60
1     5
2    13
3     3
4    84
dtype: int64